/*Написати програму «Автоматизована інформаційна система залізничного вокзалу».
Система містить: відомості про відправленняі поїздів.
Для кожного поїзду вказують: номер, час відправлення, станція призначення. 
Забезпечити:
o Уведення даних в систему(або завантаження з файлу);
o Доповнення системи новими даними;
o Вивід інформації про всі поїзди на вибір користувача(за зростанням номерів, за напрямом чи по часу відправлення);
o Вивід інформації про певний поїзд;
o Вилучення поїзда з системи
Використати вектор(дек), ітератори, алгоритми.*/

#include "Menu.h"

int main()
{
	Menu menu;
	menu.Start();
	
	return 0;
}