/*Опишіть класи Swordsman; (Мечник), Archer (Лучник) і Mage (Маг), кожен з яких є
екземпляром базового(можна абстрактного) класу Unit (штука, елемент) в комп’ютерній
грі, і може атакувати, ухилятись від атак і вмирати.
У мечника 15 хіт-поінтів (життів), пошкодження при атаці 5, шанс ухилятись 60%.
Лучник: 12 hp, 4 dmg, 40% dodge
Маг: 8 hp, 10 dmg, 30% dodge
-------------------------------------------------------------------------------------------------------------
Опишіть клас Team(Команда), у якому є поля
o назва команди
o масив чи вектор по три(чи більше) юніта, причому тип юніта (мечник, лучник чи маг) має задаватись випадково,
при заповненні команди(на початку гри).
Написати методи:
o перевірки чи у команді є не вбиті гравці
o виводу гравців команди
-------------------------------------------------------------------------------------------------------------
Опишіть клас Game;(Гра), що містить 2 команди ворогуючих сторін
Можливі варіанти ворогуючих сторін:
 - три лучники проти мечника і двох магів, або лучник, мечник і маг проти двох мечників і
лучника і т.д(при кількості гравців у команді 3).

Опишіть метод бою між КОМАНДАМИ, поки бійці однієї з сторін всі не загинуть. В
консоль при цьому виводьте повідомлення хто кого атакував, чи вдалась атака, скільки
життя залишилось у жертви чи вона загинула. Нехай бій відбувається поступово, по
натиснення клавіші spacebar (пробіла), щоб ми могли спостерігати його атака за атакою.
В кінці бою оголосіть, яка команда перемогла (перша/друга, синя/червона, альянс/орки чи ін.).
...............................................................................................................
Правила бою : кожен боєць (Воїн, Лучник чи Маг) вишукує серед ворогів суперника свого
типу і атакує його.
Скажімо, якщо маємо команди:
A11 - M21
A12 - S22
S13 - A23
...то А11 має вибрати своєї ціллю А23.
Якщо ворогів свого типу не знайдено, тоді нехай бійці атакують довільного суперника*/

#include "Game.h"

int main()
{
	srand(time(0));

	string name;

	cout << " Enter name for your team: ";
	getline(cin, name);

	Game game(name);
	game.Play();

	return 0;
}